# Introducción a Pandas

Aprenderemos a utilizar pandas para el análisis de datos:

* Introducción a Pandas
* Series
* DataFrames
* Valores perdidos
* GroupBy
* Fusionado, Unión y Concatenación
* Operaciones habituales
* Entrada y salida de datos

___

In [5]:
import numpy as np
import pandas as pd

# Series

### Creando Series

Conversión de una lista, Array Numpy o diccionario a Series:

In [6]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

print (labels)
print (my_list)
print (arr)
print (d)

['a', 'b', 'c']
[10, 20, 30]
[10 20 30]
{'a': 10, 'b': 20, 'c': 30}

### Usando listas

In [8]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [9]:
# Asignamos etiquetas a la serie
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

### Usando Arrays

In [11]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

### Usando Diccionarios

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Usando índices

La clave para usar Series, es entender sus índices. Pandas usa los índices en formato numéricos o texto.

In [17]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])                                   
print (ser1)
print ()
print (ser2)

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [21]:
print(ser1[['USA']])
print(ser1[['USSR','USA']])
print(ser1[['USSR','USA', 'Japan']])

USA    1
dtype: int64
USSR    3
USA     1
dtype: int64
USSR     3
USA      1
Japan    4
dtype: int64

In [22]:
a = "a"
b = "b"
print(a+b)

ab

In [23]:
# Las operaciones se realizan en función del índice
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

Los DataFrames están directamente inspirados del lenguaje de programación R.  Podemos ver un DataFrame como un conjunto de objetos Series unidos.

In [27]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [55]:
np.random.seed(123)
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
#df = pd.DataFrame(randn(5,4),index=['A','B','C','D','E'],columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

### Selección e indexación

In [56]:
df['W']

A   -1.085631
B   -0.578600
C    1.265936
D    1.491390
E    2.205930
Name: W, dtype: float64

In [36]:
type(df)

pandas.core.frame.DataFrame

In [57]:
# Selección de varias columnas por su nombre
df[['W','Z']]

          W         Z
A -1.085631 -1.506295
B -0.578600 -0.428913
C  1.265936 -0.094709
D  1.491390 -0.434351
E  2.205930  0.386186

In [38]:
# Pandas también permite sintaxis tipo SQL, no obstante no se recomienda su uso.
df.W

A   -1.085631
B   -0.578600
C    1.265936
D    1.491390
E    2.205930
Name: W, dtype: float64

¿Qué tipo de dato hay en la columna W?

In [18]:
type(df['W'])

pandas.core.series.Series

Como vemos la columna W es simplemente una Serie

**Creando una nueva columna:**

In [58]:
df['nueva'] = df['W'] + df['Y']
df

          W         X         Y         Z     nueva
A -1.085631  0.997345  0.282978 -1.506295 -0.802652
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279
C  1.265936 -0.866740 -0.678886 -0.094709  0.587050
D  1.491390 -0.638902 -0.443982 -0.434351  1.047408
E  2.205930  2.186786  1.004054  0.386186  3.209984

In [59]:
df['clase'] = 0
df

          W         X         Y         Z     nueva  clase
A -1.085631  0.997345  0.282978 -1.506295 -0.802652      0
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279      0
C  1.265936 -0.866740 -0.678886 -0.094709  0.587050      0
D  1.491390 -0.638902 -0.443982 -0.434351  1.047408      0
E  2.205930  2.186786  1.004054  0.386186  3.209984      0

**Eliminar columnas**

In [60]:
df.drop('nueva',axis=1)

          W         X         Y         Z  clase
A -1.085631  0.997345  0.282978 -1.506295      0
B -0.578600  1.651437 -2.426679 -0.428913      0
C  1.265936 -0.866740 -0.678886 -0.094709      0
D  1.491390 -0.638902 -0.443982 -0.434351      0
E  2.205930  2.186786  1.004054  0.386186      0

In [61]:
# A menos que lo especifiquemos con inplace, no se elimina nada
df

          W         X         Y         Z     nueva  clase
A -1.085631  0.997345  0.282978 -1.506295 -0.802652      0
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279      0
C  1.265936 -0.866740 -0.678886 -0.094709  0.587050      0
D  1.491390 -0.638902 -0.443982 -0.434351  1.047408      0
E  2.205930  2.186786  1.004054  0.386186  3.209984      0

In [23]:
df.drop('nueva',axis=1, inplace=True)
df

          W         X         Y         Z  clase
A -1.085631  0.997345  0.282978 -1.506295      0
B -0.578600  1.651437 -2.426679 -0.428913      0
C  1.265936 -0.866740 -0.678886 -0.094709      0
D  1.491390 -0.638902 -0.443982 -0.434351      0
E  2.205930  2.186786  1.004054  0.386186      0

In [62]:
df = df.drop('clase',axis=1)
df

          W         X         Y         Z     nueva
A -1.085631  0.997345  0.282978 -1.506295 -0.802652
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279
C  1.265936 -0.866740 -0.678886 -0.094709  0.587050
D  1.491390 -0.638902 -0.443982 -0.434351  1.047408
E  2.205930  2.186786  1.004054  0.386186  3.209984

**Eliminar filas**

In [66]:
df.drop('E',axis=0)

          W         X         Y         Z     nueva
A -1.085631  0.997345  0.282978 -1.506295 -0.802652
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279
C  1.265936 -0.866740 -0.678886 -0.094709  0.587050
D  1.491390 -0.638902 -0.443982 -0.434351  1.047408

In [70]:
df.shape

(5, 5)

**Selección de filas**

In [75]:
df.loc['A']

W       -1.085631
X        0.997345
Y        0.282978
Z       -1.506295
nueva   -0.802652
Name: A, dtype: float64

In [76]:
df.iloc[0]

W       -1.085631
X        0.997345
Y        0.282978
Z       -1.506295
nueva   -0.802652
Name: A, dtype: float64

**Selección de un subset de datos**

In [77]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.085631  0.282978
B -0.578600 -2.426679

In [78]:
# Selección de 2 filas y todas las columnas.
df.loc[['A','B'],]

          W         X         Y         Z     nueva
A -1.085631  0.997345  0.282978 -1.506295 -0.802652
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279

In [83]:
df.iloc[[0,1],]

          W         X         Y         Z     nueva
A -1.085631  0.997345  0.282978 -1.506295 -0.802652
B -0.578600  1.651437 -2.426679 -0.428913 -3.005279

### Selección condicional

Una importante característica de Pandas es la selección condicional de manera muy similar a Numpy:

In [86]:
df>0

       W      X      Y      Z
A  False   True   True  False
B  False   True  False  False
C   True  False  False  False
D   True  False  False  False
E   True   True   True   True

In [33]:
df [df>0]

          W         X         Y         Z
A       NaN  0.997345  0.282978       NaN
B       NaN  1.651437       NaN       NaN
C  1.265936       NaN       NaN       NaN
D  1.491390       NaN       NaN       NaN
E  2.205930  2.186786  1.004054  0.386186

In [87]:
print (df['W']>0)

print(df[df['W']>0])

A    False
B    False
C     True
D     True
E     True
Name: W, dtype: bool
          W         X         Y         Z
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [88]:
print (df['W']>0)
df[df['W']>0]['Y']

A    False
B    False
C     True
D     True
E     True
Name: W, dtype: bool

C   -0.678886
D   -0.443982
E    1.004054
Name: Y, dtype: float64

In [89]:
df[df['W']>0][['Y','X']]

          Y         X
C -0.678886 -0.866740
D -0.443982 -0.638902
E  1.004054  2.186786

Podemos concatenar condiciones con | y &.  Deberemos encerrar entre paréntesis cada una de las condiciones:

In [90]:
df

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [93]:
df[(df['W']>0) & (df['Y'] > 1)]

         W         X         Y         Z
E  2.20593  2.186786  1.004054  0.386186

In [39]:
df[(df['W']>0) | (df['Y'] > 1)]

          W         X         Y         Z
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

### Más sobre índices

In [94]:
df

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [97]:
# Reseteamos el índice a una secuencia de 0 a n
df.reset_index()

  index         W         X         Y         Z
0     A -1.085631  0.997345  0.282978 -1.506295
1     B -0.578600  1.651437 -2.426679 -0.428913
2     C  1.265936 -0.866740 -0.678886 -0.094709
3     D  1.491390 -0.638902 -0.443982 -0.434351
4     E  2.205930  2.186786  1.004054  0.386186

In [98]:
nuevoindice = 'CA NY WY OR CO'.split()

In [43]:
df

          W         X         Y         Z
A -1.085631  0.997345  0.282978 -1.506295
B -0.578600  1.651437 -2.426679 -0.428913
C  1.265936 -0.866740 -0.678886 -0.094709
D  1.491390 -0.638902 -0.443982 -0.434351
E  2.205930  2.186786  1.004054  0.386186

In [99]:
df['Estados'] = nuevoindice
df

          W         X         Y         Z Estados
A -1.085631  0.997345  0.282978 -1.506295      CA
B -0.578600  1.651437 -2.426679 -0.428913      NY
C  1.265936 -0.866740 -0.678886 -0.094709      WY
D  1.491390 -0.638902 -0.443982 -0.434351      OR
E  2.205930  2.186786  1.004054  0.386186      CO

Utilizamos la columna Estados como índice en el dataset

In [100]:
df.set_index('Estados')

                W         X         Y         Z
Estados
CA      -1.085631  0.997345  0.282978 -1.506295
NY      -0.578600  1.651437 -2.426679 -0.428913
WY       1.265936 -0.866740 -0.678886 -0.094709
OR       1.491390 -0.638902 -0.443982 -0.434351
CO       2.205930  2.186786  1.004054  0.386186

Tenemos que tener en cuenta que si no usamos el argumento inplace, no se aplican los cambios

In [101]:
df

          W         X         Y         Z Estados
A -1.085631  0.997345  0.282978 -1.506295      CA
B -0.578600  1.651437 -2.426679 -0.428913      NY
C  1.265936 -0.866740 -0.678886 -0.094709      WY
D  1.491390 -0.638902 -0.443982 -0.434351      OR
E  2.205930  2.186786  1.004054  0.386186      CO

In [102]:
df.set_index('Estados', inplace=True)
df

                W         X         Y         Z
Estados
CA      -1.085631  0.997345  0.282978 -1.506295
NY      -0.578600  1.651437 -2.426679 -0.428913
WY       1.265936 -0.866740 -0.678886 -0.094709
OR       1.491390 -0.638902 -0.443982 -0.434351
CO       2.205930  2.186786  1.004054  0.386186

### Índices múltiples y jerarquía en los índices

In [119]:
# Creamos diferentes 'índices'
outside = ['G1','G1','G1','G2','G2','G3']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [120]:
print (outside)
print (inside)
print (hier_index)

['G1', 'G1', 'G1', 'G2', 'G2', 'G3']
[1, 2, 3, 1, 2, 3]
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G3', 3)],
           )

In [121]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.890706  1.754886
   2  1.495644  1.069393
   3 -0.772709  0.794863
G2 1  0.314272 -1.326265
   2  1.417299  0.807237
G3 3  0.045490 -0.233092

¿Cómo extraemos los datos en base a este índice doble?

In [113]:
# Haciendo uso de .loc
df.loc['G1']

          A         B
1  0.338589 -0.011830
2  2.392365  0.412912
3  0.978736  2.238143

In [118]:
df.loc['G1'].loc[1]

A    0.338589
B   -0.011830
Name: 1, dtype: float64

Podemos entender G1 y G2 como una columna extra que se usa para el filtrado.
Además a los índices podemos asignarles nombres

In [122]:
df.index.names

FrozenList([None, None])

In [123]:
df.index.names = ['Grupo','Número']
df

                     A         B
Grupo Número
G1    1       0.890706  1.754886
      2       1.495644  1.069393
      3      -0.772709  0.794863
G2    1       0.314272 -1.326265
      2       1.417299  0.807237
G3    3       0.045490 -0.233092

Supongamos que queremos obtener aquellos datos cuyo grupo es G1 y su número es 1

In [124]:
df.xs(['G1',1])

C:\Users\german\AppData\Local\Temp\ipykernel_4528\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A    0.890706
B    1.754886
Name: (G1, 1), dtype: float64

# Valores perdidos

In [125]:
import numpy as np
import pandas as pd

In [136]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [58]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [59]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [60]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [128]:
df.fillna(value='Valor Rellenado')

In [137]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Una caso más elaborado (y habitual), sería el de imputar la media de su columna a los NA

In [62]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby
El método groupby permite agrupar filas en base a un criterio y ejecutar operaciones de agregación sobre las mismas.

In [142]:
import pandas as pd
# Generación del dataframe
data = {'Compañía':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Trabajador':['Ana','Carlos','Rosa','Vanesa','Carlos','Sara'],
       'Ventas':[200,120,340,124,243,350]}
df = pd.DataFrame(data)

In [143]:
df

  Compañía Trabajador  Ventas
0     GOOG        Ana     200
1     GOOG     Carlos     120
2     MSFT       Rosa     340
3     MSFT     Vanesa     124
4       FB     Carlos     243
5       FB       Sara     350

In [144]:
# Agrupamos los datos en base a la columna Compañía
df.groupby('Compañía')

In [145]:
# Guardamos el resultado en una variable
grupo = df.groupby('Compañía')

In [150]:
# Ahora podemos aplicar funciones sobre la agrupación.
grupo.sum(numeric_only=True)

          Ventas
Compañía
FB           593
GOOG         320
MSFT         464

In [147]:
# Ejecutado todo de una vez
df.groupby('Compañía').mean()

          Ventas
Compañía
FB         296.5
GOOG       160.0
MSFT       232.0

Más ejemplos de agregaciones

In [148]:
df.groupby('Compañía').count()

          Trabajador  Ventas
Compañía
FB                 2       2
GOOG               2       2
MSFT               2       2

In [70]:
df.groupby('Compañía').std()

              Ventas
Compañía
FB         75.660426
GOOG       56.568542
MSFT      152.735065

Podemos hacer un 'describe' para ver las características de nuestra agrupación de datos

In [149]:
df.describe()

           Ventas
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [71]:
grupo.describe()

         Ventas
          count   mean         std    min     25%    50%     75%    max
Compañía
FB          2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG        2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT        2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [72]:
# Si no nos gusta como se muestra la información podemos usar el método transpose
grupo.describe().transpose()

Compañía              FB        GOOG        MSFT
Ventas count    2.000000    2.000000    2.000000
       mean   296.500000  160.000000  232.000000
       std     75.660426   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    269.750000  140.000000  178.000000
       50%    296.500000  160.000000  232.000000
       75%    323.250000  180.000000  286.000000
       max    350.000000  200.000000  340.000000

In [73]:
# Descripción de la compañía FB
grupo.describe().loc['FB']

Ventas  count      2.000000
        mean     296.500000
        std       75.660426
        min      243.000000
        25%      269.750000
        50%      296.500000
        75%      323.250000
        max      350.000000
Name: FB, dtype: float64

In [152]:
grupo.describe().iloc[0,-1]

350.0

# Fusionado, Unión y Concatenación

In [74]:
import pandas as pd

In [170]:
# Generación de los sets de datos a utilizar
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [171]:
print (df1)
print (df2)
print (df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenacion

La concatenación, básicamente une diferentes DataFrames. Hay que tener en cuenta que las dimensiones (respecto del eje usado en la concatenación) de los diferentes DataFrames, deben ser iguales.

In [163]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [169]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  A11  B11  C11  D11
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10

## Fusionado

Permite la unión de diferentes DataFrames usando una lógica similar a la SQL a la hora de fusionar tablas.

In [172]:
izquierda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
derecha = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [173]:
izquierda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [174]:
derecha

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [178]:
# 4 diferentes tipos de fusionado: inner, left, rigth, outer
pd.merge(izquierda,derecha,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Unos casos algo más complicados

In [179]:
izquierda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
derecha = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [180]:
izquierda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [181]:
derecha

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [182]:
# Podemos fusionar las tablas en base a más de una key (columna)
pd.merge(izquierda, derecha, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [190]:
pd.merge(izquierda, derecha, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [184]:
pd.merge(izquierda, derecha, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [185]:
pd.merge(izquierda, derecha, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [191]:
## Extracción de left outer y right outer
pd.merge(izquierda, derecha, how='left', on=['key1', 'key2'], indicator=True)

  key1 key2   A   B    C    D     _merge
0   K0   K0  A0  B0   C0   D0       both
1   K0   K1  A1  B1  NaN  NaN  left_only
2   K1   K0  A2  B2   C1   D1       both
3   K1   K0  A2  B2   C2   D2       both
4   K2   K1  A3  B3  NaN  NaN  left_only

In [192]:
pd.merge(izquierda, derecha, how='right', on=['key1', 'key2'], indicator=True)

  key1 key2    A    B   C   D      _merge
0   K0   K0   A0   B0  C0  D0        both
1   K1   K0   A2   B2  C1  D1        both
2   K1   K0   A2   B2  C2  D2        both
3   K2   K0  NaN  NaN  C3  D3  right_only

## Unión
De 2 DataFrames, con índices iguales o no, en uno sólo,

In [90]:
izquierda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

derecha = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
izquierda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [91]:
derecha

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [92]:
# Observamos que el registro 2, al no existir en derecha, no se completa a nivel de columnas C y D
izquierda.join(derecha)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [93]:
izquierda.join(derecha, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operaciones habituales

In [193]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Información sobre los valores únicos de una columna

In [194]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [195]:
# Total de elementos únicos 
df['col2'].nunique()

3

In [196]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selección de datos

In [197]:
#Selección de un DataFrame filtrando en base a valores de columnas
nuevodf = df[(df['col1']>2) & (df['col2']==444)]
nuevodf

   col1  col2 col3
3     4   444  xyz

### Funciones Apply

In [200]:
def cuadrado(x):
    return x**2

In [201]:
cuadrado(6)

36

In [202]:
# Aplicamos la función cuadrado A TODOS los elementos de col1.  Es una operación columnar, por tanto no hace falta iterar registro a registro
df['col1'].apply(cuadrado)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [203]:
# Mismo resultado de diferente manera
df['col1'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [204]:
# Obtener el tamaño de las diferentes filas
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [205]:
df[['col1', 'col2']].apply(max)

col1      4
col2    666
dtype: int64

In [104]:
# Eliminar columnas (ojo, hasta no usar inplace no se eliminan del set original)
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [105]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [206]:
df.columns = ['a', 'b', 'c']
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [207]:
df

   a    b    c
0  1  444  abc
1  2  555  def
2  3  666  ghi
3  4  444  xyz

In [209]:
df.columns[0:2]

Index(['a', 'b'], dtype='object')

In [106]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [212]:
df['a'].sum()

10

In [216]:
df.columns = ['col1', 'col2', 'col3']

**Eliminar permanentemente una columna**

In [217]:
del df['col1']
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

**Ordenar los DataFrames:**

In [220]:
df.sort_values(by='col2', ascending=False) #inplace=False por defecto

# Nota, observad como el índice no varía.  Cada registro sigue manteniendo el índice original.

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz

In [110]:
df.sort_values(by=['col2','col3'], ascending=False) #inplace=False por defecto

   col2 col3
2   666  ghi
1   555  def
3   444  xyz
0   444  abc

In [111]:
df.sort_values(by=['col2','col3'], ascending=[False, True])

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz